# Brewfile — managed by ~/.dotfiles
#
# Install or update everything declared here:
#   brew bundle install --file ~/.dotfiles/Brewfile
#
# Or just run 'dotfiles update', which calls this for you.
#
# Adding a new tool? Add it here and the next 'dotfiles update' picks it up
# everywhere the dotfiles repo is installed.

# Taps
tap "epk/epk"

# Shell + core CLI
brew "bash"
brew "zsh"
brew "curl"
brew "git"
brew "wget"
brew "tmux"
brew "tree"
brew "watch"

# Modern CLI replacements
brew "eza"
brew "zoxide"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "delta"

# Git + GitHub + Docker TUIs
brew "lazygit"
brew "lazydocker"
brew "gh"

# Network / tunnels
brew "mole"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# macOS apps (casks)
cask "font-sf-mono-nerd-font"
cask "alt-tab"
cask "raycast"
cask "stats"
